// Laba5.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include <iostream>
#include <string>
#include <clocale>

using namespace std;

void main()
{
	setlocale(LC_ALL, "Russian");

	string str;
	char comma = ',';
	int qty = 0;

	getline(cin, str);

	for (int i = 0; i < str.length(); i++)
		if (str[i] == comma)
			qty++;

	if (qty > 3) {
		cout << "Какую запятую по счету менят: ";
		cin >> qty;
		for (int i = 0; i < str.length(); i++) {
			if (str[i] == comma) qty--;
			if (!qty) {
				str.replace(i, 1, ".");
				break;
			}
		}

	}
	else
		for (int i = 0; i < str.length(); i++)
			if (str[i] == comma)
				str.replace(i, 1, "");

	cout << str << endl;
	system("pause");
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
